intersectSurfWithCurve(Surface!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean,Arr&lt;System.Double[N2][2]&gt;*,Arr&lt;System.Double&gt;*,Arr&lt;System.Double[N3][3]&gt;*,Err*,crs.Map&lt;GCurve!System.Runtime.CompilerServices.IsConst**,Arr&lt;System.Double[N3][3]&gt;,std.less&lt;GCurve!System.Runtime.CompilerServices.IsConst**&gt;,tnallc&lt;std.pair&lt;GCurve!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst,Arr&lt;System.Double[N3][3]&gt;&gt;&gt;&gt;*,Owner&lt;GCurve&gt;*)
Intersect a surface and a curve.
Returns:
CS_DISJOIN - if there is no intersection
CS_SUBSET - if curve is coincident with surface
CS_OVERLAP - if curve is not coincident and there are intersections
CS_ERROR - if there is error,  pErr contain error.
Input: the surface and curve to intersect
withinCurveBounds: if true, only return intersections within the curve bounds.
normalizedCurveParams: if true, return normalized curve parameters.
Note: if withinCurveBounds or normalizedCurveParams is true, the curve must be bounded.
Output (all optional):
pSurfParams: the coordinates of the intersection point(s) in the parameter space of the
surface.
pCurveParams: the coordinates of the intersection point(s) in the parameter
space of the curve (listed in the same order as pSurfParams).
pPnts: the array of 3D intersection points (listed in the same order as
pSurfParams and pCurveParams).
pErr: Set to ERR_SUCCESS if successful, failure code if not. This API should
be changed to have return type Err and return CompareSetResult as an output
argument.
The interface to this routine may be changed in the future in order
to accommodate more general intersection types (e.g., a curve/surface
intersection may consist of isolated points, curves of tangency, etc.).